N = int(input())  # 연락처 수

list = []  # 연락처 목록

for i in range(N):
    name, phone = input().split()
    data = name, phone

    list.append(data)
    list.sort()

for result in list:
    print(*result)  # 언패킹

'''
[ 입력 ]
3
kim 010-1111-1111
eve 010-9999-9999
kim 010-0000-0000
[ 출력 ]
eve 010-9999-9999
kim 010-0000-0000
kim 010-1111-1111

[ 입력 ]
5
aaaa 010-7470-9619
aaa 010-5711-7180
aa 010-3009-2551
a 010-4362-3829
abc 010-4166-8204
[ 출력 ]
a 010-4362-3829
aa 010-3009-2551
aaa 010-5711-7180
aaaa 010-7470-9619
abc 010-4166-8204

[ 입력 ]
asdf 010-9999-9999
dddd 010-0000-0000
a 010-4817-2344
b 010-0000-0001
aaaa 010-0000-0000
aaa 010-0000-0001
aaa 010-0000-0002
[ 출력 ]
a 010-4817-2344
aaa 010-0000-0001
aaa 010-0000-0002
aaaa 010-0000-0000
asdf 010-9999-9999
b 010-0000-0001
dddd 010-0000-0000
'''